[
  {
    "path": "posts/2021-06-27-isss608-visual-analytics-and-applications-project-proposal/",
    "title": "ISSS608 Visual Analytics and Applications Project Proposal",
    "description": "This is the proposal of our group's Visual Analytics and Applications Project",
    "author": [],
    "date": "2021-06-27",
    "categories": [],
    "contents": "\r\nBackground and Objectives\r\nThe company in question is GAStech International (“GT”), which operates in Abila, Kronos, has company cars approved for both personal and business use. Those that do not have company cars have the ability to check out company trucks for business use, but not for personal business. These vehicles have geospatial tracking software to track their movement. To add on to this, GT employees are provided with loyalty and credit cards whose usages are also monitored.\r\nWe, as visual analytics experts, are supposed to use the above information to assist law enforcement in identifying which GT employees made which purchases and identify suspicious patterns of behaviour and make recommendations for further investigation.\r\nUnderstanding the Dataset\r\nWe are provided with the following csv files:\r\nFile\r\nDescription\r\nVariables\r\ncar-assignments.csv\r\nA list of vehicle assignments by employee\r\nEmployee Last Name, Employee First Name, Car ID, Current Employment Type (Department), Current Employment Title (job title)\r\ncc_data.csv\r\nCredit and debit card transaction data\r\nTimestamp, Location (name of the business), Price, Last 4 digits of the credit or debit card number\r\nloyalty_data.csv\r\nLoyalty card transaction data\r\nTimestamp, Location (name of the business), Price, Loyalty Number (A 5-character code starting with L that is unique for each card)\r\ngps.csv\r\nVehicle tracking data\r\nTimestamp, Car ID, Latitude, Longitude\r\nOther information we are provided with are as follows:\r\nESRI shapesfiles of Abila, Kronos\r\nMC2-tourist.jpg, which is a tourist map of Abila, Kronos with locations of interest identified\r\n\r\nWe will proceed by looking through the CSV files in more detail to further understand the datasets provided.\r\ncar-assignments.csv, 44 rows\r\nColumn\r\nType\r\nValues\r\nLastName\r\nString\r\n44 unique values when combined with FirstName\r\nFirstName\r\nString\r\nSee LastName\r\nCarID\r\nNumber (Integer)\r\n1 to 35\r\nCurrentEmploymentType\r\nString\r\n5 unique values\r\nCurrentEmploymentTitle\r\nString\r\n21 unique values\r\nNote: Each employee is allocated 1 car, however, there are 9 employees that are not assigned cars. These 9 employees are truck drivers.\r\nTaking a closer look into CurrentEmploymentType and CurrentEmploymentTitle gives us an overview of the organisation structure.\r\n\r\nEach employee can only have one employment title while one employment title can have 1 or more employees. Each employment type has more than 1 employment title and at least one manager that supervises the department. The identified managers are as follows:\r\nCurrentEmploymentType\r\nCurrentEmploymentTitle (Manager)\r\nEngineering\r\nEngineering Group Manager and Drill Site Manager\r\nExecutive\r\nPresident/CEO\r\nFacilities\r\nFacilities Group Manager\r\nInformation Technology\r\nIT Group Manager\r\nSecurity\r\nSecurity Group Control\r\ncc-data.csv, 1,490 rows\r\nColumn\r\nType\r\nValues\r\ntimestamp\r\nDate (mm/dd/yyyy) and time\r\n1/6/2014 7:28 to 1/19/2014 20:51\r\nlocation\r\nString\r\n34 unique values\r\nprice\r\nNumber (Decimal)\r\n2.01 to 10,000.00\r\nlast4accnum\r\nString\r\n55 unique values\r\nPlotting the price on a box plot, we have noted the following:\r\n\r\nloyalty-data.csv, 1,392 rows\r\nColumn\r\nType\r\nValues\r\ntimestamp\r\nDate (mm/dd/yyyy)\r\n1/6/2014 to 1/19/2014\r\nlocation\r\nString\r\n33 unique values\r\nprice\r\nNumber (Decimal)\r\n3.00 to 4,983.52\r\nloyaltynumber\r\nString\r\n54 unique values\r\nNote: Looking at the difference for locations in cc-data and loyalty-data, it seems that Daily Dealz does not offer loyalty points.\r\nPlotting the price on a box plot, we have noted the following:\r\n\r\ngps.csv, 685,169 rows\r\nColumn\r\nType\r\nValues\r\ntimestamp\r\nDate (mm/dd/yyyy) and time\r\n1/6/2014 6:28 to 1/19/2014 20:56\r\nid\r\nNumber (Integer)\r\n40 unique values (1 to 35, 101, 104, 105, 106, 107)\r\nlat\r\nNumber (Decimal)\r\n36.04802 to 36.08996\r\nlong\r\nNumber (Decimal)\r\n24.82509 to 24.90849\r\nIt looks like IDs 1 to 35 corresponds to carID in car-assignment.csv. Assume that 101, 104, 105, 106, 107 are Truck IDs. This is interesting to note that this means there are 5 trucks for 9 truck drivers.\r\nMethodology and Scope\r\nWe aim to answer the following questions found in VAST 2021 Mini-challenge 2:\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies?\r\nAdd the vehicle data to your analysis of the credit and loyalty card data. How does your assessment of the anomalies in question 1 change based on this new data? What discrepancies between vehicle, credit, and loyalty card data do you find?\r\nCan you infer the owners of each credit card and loyalty card? What is your evidence? Where are there uncertainties in your method? Where are there uncertainties in the data?\r\nGiven the data sources provided, identify potential informal or unofficial relationships among GASTech personnel. Provide evidence for these relationships.\r\nDo you see evidence of suspicious activity? Identify 1-10 locations where you believe the suspicious activity is occurring, and why?\r\nIn order to answer the above questions, this will be the scope and methodology we hope to follow these steps:\r\nAnalysis of dataset with background research\r\nExploratory Data Analysis (EDA) methods in R\r\nExploratory Spatial Data Analysis (ESDA) methods in R\r\nR Markdown development for functionality checks\r\nR-Shiny app development for user interactivity\r\nWe hope the answer the VAST questions by using data analysis in steps 2 and 3 to answer the following questions based off our understanding of the datasets in step 1 :\r\nVAST Questions\r\nDataset Questions\r\n1, 2 and 3\r\nWhich employees have been at which locations at the same time? Which cards and vehicles are used during then? There are 54 and 55 unique loyalty and CC cards respectively, however, there are only 44 unique employees. How were these extra cards used? There are 35 and 34 unique locations where the cc has been used and loyalty points have been issued. Which location is the most popular among the employees?\r\n4 and 5\r\nHave the supervisors been supervising their employees? Do employees from different employment types and titles hang out together? Which employees have the highest interactions with truck drivers and where?\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-27T16:30:56+08:00",
    "input_file": {}
  }
]
